#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform

Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/DevopsFiapSoat3-G35/postech-fase-3-db/runs/run-ndw4rFJqmT65M1sD

Waiting for the plan to start...

Terraform v1.7.4
on linux_amd64
Initializing plugins and modules...
data.aws_vpc.selected: Refreshing...
data.aws_vpc.selected: Refresh complete after 0s [id=vpc-09b8ceba5c2ccaa0d]
data.aws_subnet_ids.example: Refreshing...
aws_security_group.instance: Refreshing state... [id=sg-0700c5f78ac427bea]
data.aws_subnet_ids.example: Refresh complete after 0s [id=vpc-09b8ceba5c2ccaa0d]
data.aws_subnet.example["subnet-077272c175473e24d"]: Refreshing...
data.aws_subnet.example["subnet-0c73bab4656a0f8f0"]: Refreshing...
data.aws_subnet.example["subnet-0fb0b41fe6aabed10"]: Refreshing...
data.aws_subnet.example["subnet-0c5485c27b7f4c992"]: Refreshing...
data.aws_subnet.example["subnet-0d748631e6958b9dd"]: Refreshing...
data.aws_subnet.example["subnet-0e93b42bbb72495e3"]: Refreshing...
data.aws_subnet.example["subnet-077272c175473e24d"]: Refresh complete after 0s [id=subnet-077272c175473e24d]
data.aws_subnet.example["subnet-0e93b42bbb72495e3"]: Refresh complete after 0s [id=subnet-0e93b42bbb72495e3]
data.aws_subnet.example["subnet-0c5485c27b7f4c992"]: Refresh complete after 0s [id=subnet-0c5485c27b7f4c992]
data.aws_subnet.example["subnet-0c73bab4656a0f8f0"]: Refresh complete after 0s [id=subnet-0c73bab4656a0f8f0]
data.aws_subnet.example["subnet-0d748631e6958b9dd"]: Refresh complete after 0s [id=subnet-0d748631e6958b9dd]
data.aws_subnet.example["subnet-0fb0b41fe6aabed10"]: Refresh complete after 0s [id=subnet-0fb0b41fe6aabed10]
aws_security_group.instance: Drift detected (update)

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_db_instance.education will be created
  + resource "aws_db_instance" "education" {
      + address                               = (known after apply)
      + allocated_storage                     = 5
      + apply_immediately                     = (known after apply)
      + arn                                   = (known after apply)
      + auto_minor_version_upgrade            = true
      + availability_zone                     = (known after apply)
      + backup_retention_period               = (known after apply)
      + backup_window                         = (known after apply)
      + ca_cert_identifier                    = (known after apply)
      + character_set_name                    = (known after apply)
      + copy_tags_to_snapshot                 = false
      + db_subnet_group_name                  = "education"
      + delete_automated_backups              = true
      + endpoint                              = (known after apply)
      + engine                                = "postgres"
      + engine_version                        = "14.11"
      + hosted_zone_id                        = (known after apply)
      + id                                    = (known after apply)
      + identifier                            = "education"
      + identifier_prefix                     = (known after apply)
      + instance_class                        = "db.t3.micro"
      + kms_key_id                            = (known after apply)
      + latest_restorable_time                = (known after apply)
      + license_model                         = (known after apply)
      + maintenance_window                    = (known after apply)
      + monitoring_interval                   = 0
      + monitoring_role_arn                   = (known after apply)
      + multi_az                              = (known after apply)
      + name                                  = (known after apply)
      + option_group_name                     = (known after apply)
      + parameter_group_name                  = (known after apply)
      + password                              = (sensitive value)
      + performance_insights_enabled          = false
      + performance_insights_kms_key_id       = (known after apply)
      + performance_insights_retention_period = (known after apply)
      + port                                  = (known after apply)
      + publicly_accessible                   = true
      + replicas                              = (known after apply)
      + resource_id                           = (known after apply)
      + skip_final_snapshot                   = true
      + snapshot_identifier                   = (known after apply)
      + status                                = (known after apply)
      + storage_type                          = (known after apply)
      + tags                                  = {
          + "Name" = "MyPostgresDB"
        }
      + timezone                              = (known after apply)
      + username                              = "postgres"
      + vpc_security_group_ids                = [
          + "sg-0700c5f78ac427bea",
        ]
    }

  # aws_db_subnet_group.education will be created
  + resource "aws_db_subnet_group" "education" {
      + arn         = (known after apply)
      + description = "Managed by Terraform"
      + id          = (known after apply)
      + name        = "education"
      + name_prefix = (known after apply)
      + subnet_ids  = [
          + "subnet-077272c175473e24d",
          + "subnet-0c5485c27b7f4c992",
          + "subnet-0c73bab4656a0f8f0",
          + "subnet-0d748631e6958b9dd",
          + "subnet-0e93b42bbb72495e3",
          + "subnet-0fb0b41fe6aabed10",
        ]
      + tags        = {
          + "Name" = "Education"
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + rds_hostname       = (sensitive value)
  + rds_port           = (sensitive value)
  + subnet_cidr_blocks = [
      + "10.0.2.0/24",
      + "10.0.3.0/24",
      + "10.0.4.0/24",
      + "10.0.6.0/24",
      + "10.0.1.0/24",
      + "10.0.5.0/24",
    ]

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @alinedonatoc, Action: `pull_request`*